writedown.html
<!doctype html>
<html lang="en">
<head>
<title>Writedown Documentation</title>
<!-- 2020-03-21 Sat 16:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Paul Joshy">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Writedown Documentation</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a format that I've devised for jotting down pseudocode. I think it is better because
</p>
<ul class="org-ul">
<li>It forces us to think like a compiler and stick to rigid rules
</li>
<li>It's top to bottom and we don't have to go back and edit what we've written
</li>
<li>It's equally easy to write it down or type it out in a regular computer
</li>
<li>It is engineered for repetitive output so it's easier for our brain to recognize patterns easily
</li>
</ul>


<p>
Idk if it's useful or not but if I'm being ambitious I think it can
</p>

<ul class="org-ul">
<li>Work as an export format for logging
</li>
<li>Can automate test cases by checking congruency of diff writedown files
</li>
<li>Can be used to teach introductory CS to almost anyone without the need for an actual computer
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Basic rules</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>All variables are functions
</li>
<li>All functions should return output even when piped
</li>
<li>if you're in a function (f prefixed) block or an argument (&lt;&gt;) block, you don't have to give output
</li>
<li>deferred output (written in o block) should give outputs with variables or expressions. eg <code>variable[output]</code> or <code>?[output]</code>
</li>
<li>all outputs except in &lt;&gt; should only be from one variable at a time
</li>
<li>functions have to be rewritten from scratch when they are changed or they can be piped to include changes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Syntax</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Basic output</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Outputs are usually enclosed within square brackets <code>[out]</code>
</li>
<li>Outputs returned by functions are enclosed inside angular brackets seperated by argumenets <code>&lt;arg1[out],arg2[out]&gt;</code>
</li>
<li>Outputs returned by constants are enclosed inside double square brackets <code>[[const output]]</code>
</li>
<li>We can append outputs inside outputs using curly braces <code>["Hi, My name is (name)"]</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Variables and constants</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Variables are denoted by regular non spaced words eg: <code>var1</code>
</li>
<li>They can be assigned values using the <code>=</code> sign eg: <code>var1 = "val"</code>
</li>
<li>constants are denoted by prefixing c before the name eg: <code>cpi=3.14</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> if block</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>An if block expression ends with <code>?</code>
</li>
<li>it has a true <code>t</code> block and a false <code>f</code> block
</li>
<li>they both are ended by a <code>et</code> block or a <code>ef</code> block respectively
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> functions</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Functions are denoted by prefixing f before the function name eg: <code>fprime</code>
</li>
<li>They are ended by prefixing e before the function name eg: <code>eprime</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Output block</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Outputs blocks are called when deferred output exists. Deferred outputs are outputs that are written long after the expression is written. for eg, calling a function or a loop.
They are called using <code>o</code> and <code>eo</code> blocks 
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Comments</h3>
<div class="outline-text-3" id="text-3-6">
<p>
You can use Single line <code>#</code> comments
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Code example</h2>
<div class="outline-text-2" id="text-4">
<p>
Here is the code for doing the following algorithm
</p>

<ul class="org-ul">
<li>Step 1: set loop = 0 and doubler = 0
</li>
<li>Step 2: Add 1 to loop
</li>
<li>Step 3: Multiply doubler by two
</li>
<li>Step 4: if Loop &lt; 4 go to step 2
</li>
<li>Step 5: Return doubler
</li>
<li>Step 6: End
</li>
</ul>

<p>
eg code
</p>
<pre class="example">
# simple looping function
loop[0], doubler[1]

fforloop&lt;loop,doubler&gt;
loop++
doubler*2
loop&lt;4?
t
=forloop&lt;loop,doubler&gt;
et

f
r&lt;doubler&gt;
ef

eforloop

=forloop&lt;loop[0],doubler[1]&gt;
o
# 1st iteration
loop[2]
doubler[2]
?[true]
# 2nd iteration
loop[2]
doubler[4]
?[true]
# 3rd iteration
loop[3]
doubler[8]
?[true]
# 4th iteration
loop[4]
doubler[16]
?[false]
&lt;doubler[16]&gt;
# 
eo

</pre>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Basic rules</a></li>
<li><a href="#sec-3">3. Syntax</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Basic output</a></li>
<li><a href="#sec-3-2">3.2. Variables and constants</a></li>
<li><a href="#sec-3-3">3.3. if block</a></li>
<li><a href="#sec-3-4">3.4. functions</a></li>
<li><a href="#sec-3-5">3.5. Output block</a></li>
<li><a href="#sec-3-6">3.6. Comments</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Code example</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Paul Joshy</p>
<p class="date">Created: 2020-03-21 Sat 16:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.2.6)</p>
</div>
</footer>
</body>
</html>
